---
kind: property
id: P:Autodesk.Revit.DB.TriOrQuadFacet.Normal
source: html/1d624286-f58a-f6e1-2695-450af9f897d3.htm
---
# Autodesk.Revit.DB.TriOrQuadFacet.Normal Property

A unit normal vector for this facet.

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```